# Архитектурный контракт: DatabaseLoader

## Метаданные
- **Версия**: 1.0.0
- **Статус**: Стабильный
- **Последнее обновление**: 2025-04-15
- **Последний редактор**: AI

## Описание
Модуль DatabaseLoader отвечает за загрузку данных в базу данных. Он является последним компонентом ETL-процесса, обеспечивающим сохранение обработанных данных в базе данных для дальнейшего использования.

## Место в архитектуре системы

```
[Excel-файлы] → Converter → [JSON-данные] → Deduplicator → [Уникальные JSON-данные] → DatabaseLoader → [База данных]
```

## Ответственности

### Что входит в зону ответственности
- Установление соединения с базой данных
- Проверка и создание необходимых таблиц и индексов
- Загрузка данных в базу данных
- Обработка транзакций и обеспечение целостности данных
- Логирование процесса загрузки и возникающих ошибок
- Предоставление статистики о процессе загрузки

### Что НЕ входит в зону ответственности
- Преобразование форматов данных (это задача Converter)
- Валидация данных (это задача Validator)
- Дедупликация данных (это задача Deduplicator)
- Обогащение данных (это задача Enricher)
- Управление схемой базы данных (это задача DBA)

## Входные данные
- Поток JSON-объектов или JSON-файл, содержащий данные для загрузки
- Конфигурация с настройками подключения к базе данных

## Выходные данные
- Результат загрузки (количество загруженных записей, ошибки и т.д.)
- Метаданные о процессе загрузки (время выполнения, статистика и т.д.)

## Алгоритм работы
1. **Установление соединения**: подключение к базе данных с использованием предоставленных параметров
2. **Проверка схемы**: проверка наличия необходимых таблиц и индексов, их создание при необходимости
3. **Подготовка данных**: преобразование JSON-объектов в формат, подходящий для загрузки в базу данных
4. **Загрузка данных**: выполнение SQL-запросов для загрузки данных в базу данных
5. **Обработка ошибок**: обработка возникающих ошибок и откат транзакций при необходимости
6. **Формирование результата**: сбор статистики и формирование результата загрузки

## Взаимодействие с другими модулями

### Входящие зависимости
- **Deduplicator**: предоставляет данные для загрузки в базу данных

## Конфигурация
Модуль DatabaseLoader должен поддерживать конфигурацию следующих параметров:
- URL базы данных
- Имя пользователя и пароль
- Параметры пула соединений
- Размер пакета для пакетной загрузки
- Таймауты операций
- Стратегия обработки ошибок

## Метрики и мониторинг
- Количество загруженных записей
- Количество ошибок при загрузке
- Время выполнения каждого этапа загрузки
- Использование ресурсов базы данных

## Ограничения и требования
- Модуль должен эффективно работать с большими объемами данных
- Модуль должен обеспечивать целостность данных при возникновении ошибок
- Модуль должен быть устойчивым к сбоям сети и базы данных
- Модуль должен поддерживать различные СУБД (PostgreSQL, MySQL и т.д.)

## Примеры использования

```java
// Пример использования DatabaseLoader в ETL-процессе
Converter converter = new ExcelConverter();
Deduplicator deduplicator = new EnhancedDeduplicator(config);
DatabaseLoader loader = new PostgreSQLLoader(dbConfig);

// Конвертация Excel в JSON
Stream<JSONObject> jsonData = converter.convert(excelFile);

// Дедупликация данных
Stream<JSONObject> uniqueData = deduplicator.deduplicate(jsonData);

// Загрузка уникальных данных в базу данных
LoadResult result = loader.loadData(uniqueData);
System.out.println("Loaded " + result.getSuccessfulRecords() + " records");
```

## Связанные контракты
- [Deduplicator Architecture Contract](./Deduplicator-Architecture-Contract.md)
- [DatabaseLoader Interface Contract](./interfaces/database-loader/contract.md)
- [JSON Schema](./data/json-schema/deduplicator-output-schema.json)
